package by.Homework.lessons.HW3.task6;

public class task6 {
    /*  Задачи 6
        1. Создать массив из 10 элементов. Заполните массив числами и вывести их в консоль (выводите через цикл for each).
            Замените каждый элемент с нечётным индексом на ноль. Выведите полученный массив в консоль через цикл for each.
        2. Создать массив из 5 чисел и заполните этот массив вручную. Создайте второй массив с размерностью больше на 1 чем первый массив.
            Необходимо скопировать первый массив со всеми значениями во второй массив. Последний элемент во втором массиве пусть будет 0.
            Выведите второй массив в консоль с помощью цикла for each.
        3.* Создать массив вручную. Заменить максимальный и минимальный элемент массива.
            Новый минимальный элемент будет (-1000), новый максимальный элемент 1000.
        4.* Создать массив (вручную). Отсортировать элементы массива в порядке возрастания.
            Вывести полученный массив. Выполнить с помощью цикла for

        Задачи со звёздочкой необязательны к выполнению, но рекомендую попробовать сделать.
     */
}
