package by.Homework.lessons.HW9.task19;

public class Task19 {
}

/*  Домашнее задание № 19
    Гербер Шилдт. Полное руководство. Java 12 -ое издание. Страницы: с 443-473,
    Стримы: https://struchkov.dev/blog/ru/java-stream-api/

    1   Создать интерфейс, который будет обрабатывать входящий параметр типа String.
    1.1 На основании этого интерфейса создать лямбда выражение, которое будет возвращать строку с большими буквами.

    2. Создать класс Город. Поля id, имя города, население, континент (Enum)
    2.1. Создать города
    2.2. Найти самый густонаселённый город на континенте (filter по континенту+ max)
    2.3. Найти город, с минимальным населением на континенте. (filter по континенту+ min)
    2.4. Найти самый густонаселённый город (max)
    2.5. Найти город с самым маленьким населением. (min)
    2.6. Найти первый попавшиеся город, у которого население больше 1млн. (filter + findFirst).
    2.7. Отобрать города с населением больше 1 млн. (filter)
    2.8. Создать коллекцию из названий городов, на основании объектов (map)

    Ссылку на пул реквест скидывать в личку
    Сроки выполнения: 19.07.2026

    Вопросы для проработки:
    1. Что такое функциональный интерфейс?
    2. Сколько default методов может быть в функциональном интерфейсе?
    3. Какие типы методов бывают в stream?
    4. Что делают методы filter, map

 */
