package by.Homework.lessons.HW3;

public class task8 {

    /*  Вопросы для проработки:
        1. Для чего нужен класс String?
        2. Что такое статический вложенный класс?
        3. Что такое вложенный класс?
     */

    public void printResultTask8() {
        System.out.println("1. ");
        System.out.println(result1("Я люблю java", "java"));
        System.out.println("********");

        System.out.println("2. ");
        String textResult2 = result2(5, "text");
        System.out.println(textResult2);
        System.out.println("********");

        System.out.println("3. ");
        System.out.println(result3());
        System.out.println("********");
    }

    private String result1(String str1, String str2) {
        /*  1. Задание
            1.1.Напишите метод, который будет возвращать String и принимать в качестве 1-ого параметра и 2-ого параметра объекты типа String.
            1.2.В этом методе необходимо выполнить следующую логику. Если строка в 1-ом параметре заканчивается строкой из второго
                параметра, то необходимо вырезать из строки 1-ого параметра значение строки не включающей строку из второго параметра.
                Иначе вернуть строку из 1-ого параметра приведённую к верхнему регистру.
                Пример. Есть 1-ая строка «Я люблю java» и 2-ая строка «java». Так как первая строка оканчивается такой же строкой
                что и 2-ая строка (java), то метод должен вернуть «Я люблю» иначе метод должен вернуть «Я ЛЮБЛЮ».
                В этом методе нужно использовать методы для работы со строками: endWith(), indexOf(), substring(), toUpperCase();
            1.3 В методе main вызовите этот метод, передайте любые строки, в качестве аргументов и выведите результат вконсоль.
         */

        String result;
        if (str1.endsWith(str2)) {
            result = str1.substring(0, str1.indexOf(str2));
        } else result = str1.toUpperCase();

        return result;
    }

    private String result2 (int k, String text){
        /* 2. Дан текст.
            2.1 В тексте после символа каждого слова с индексом k вставить заданную подстроку. Используемые методы (split(), substring())
              Вынести это в отдельный метод с сигнатурой public String (int k, String text)
        */

        String string = "Каждая строка, создаваемая с помощью оператора new, литерала (заключенная в двойные апострофы)" +
                " или метода класса, создающего строку, является экземпляром класса String. Особенностью объекта класса" +
                " String является то, что его значение не может быть изменено после создания объекта при помощи любого" +
                " метода класса. Изменение строки всегда приводит к созданию нового объекта в heap. Сама объектная" +
                " ссылка при этом сохраняет прежнее значение и хранится в стеке. Произведенные изменения можно сохранить переинициализируя ссылку.";
        String result = "";
        String[] words = string.split(" ");

        //ПОСЛЕ индекса k
        for (String word : words) {
            String temp = word.replaceAll("[,.]", "");
            if (temp.length() > k) temp = temp.substring(0, k+1) + text + temp.substring(k+1);
            else temp = word;

            //если в конце слова есть . или , то это не часть слова, мы их сначала уберем, а потом вернем
            //можно было бы и другие символы, это скорее пример для данного текста
            //не учел еще скобки, сомневаюсь что на данном этапе мы должны так заморачиваться
            if (word.matches(".*[,.]$") && !temp.equals(word)) temp += word.substring(word.length()-1);
            result += temp + " ";
        }

        return result.trim();
    }

    private String result3 (){
        /* 3.* Дан текст:
            3.1 Из текста удалить все символы, кроме пробелов, не являющиеся буквами.
            Между последовательностями подряд идущих букв оставить хотя бы один пробел.
            (задача с использованием регулярных выражений)
        */

        String string = "Да1та выпуска 8 декабря 1998 года[12]. Кодовое имяPlayground. В данном случае встречается путаница." +
                " Выпускались книги, например,Beginning Java 2 by Ivor Horton (Mar 1999), фактически по J2SE 1.2 (бывшее название — Java 2)." +
                " Вместе с тем по сей день такие книги публикуются, например: Х. М. Дейтел, П. Дж. Дейтел, С. И. Сантри." +
                " Технологии программирования на Java2. Распределённые приложения (2011). В то время, когда, как известно," +
                " Java 2была исторически заменена следующими релизами, подобные названия книг дезориентируют в понимании," +
                " о какой же версии Java они написаны на самом деле. Если J2SE 1.2 принято считать за Java 2, а авторы книг" +
                " за Java 2 принимают JDK7, это приводит к полной путанице.";

        String result = string.replaceAll("[^a-zA-Zа-яА-ЯёЁ ]", "");
        result = result.replaceAll("\\s{2,}", " ");     // \\s - пробелы. Можно было \\s* - все пробелы. \\s{2,} - от двух и более

        return result;
    }
}
