package by.Homework.lessons.HW9.task20;

public class Task20 {
}

/*  Домашнее задание №20
    Гербер Шилдт. Полное руководство. Java 12 -ое издание. Страницы: с 1103-1109 1.

    1. Создать задачу Callable, которая генерирует 10 файлов с 10 произвольными строками -> засыпает произвольно на 1-3 секунды,
        результат выполнения –коллекция имен файлов. Запустить 10 задач параллельно в пуле из 3 потоков.
        Вывести ход программы на экран с указанием имени потока, который выполняет работу.

    Ссылку на пул реквест скидывать в личку
    Сроки выполнения: 19.07.2026

    Вопросы для проработки
    1. Как создать пул потоков
    2. Как запустить метод в пуле потоков? Что для этого нужно сделать?
    3. Расскажите про класс Future?

 */