package by.Homework.lessons.HW7;

public class Task14 {
    /*  Домашние задание №14
        1. Создать класс пациент, палата, отделение.
        1.1 У пациента поля: уникальный идентификатор, имя, фамилия, диагноз, возраст, пол (сделать enum класс: Мужской, Женский).
        1.2 У палаты поля: номер, тип палаты (энам мужская или женская), список пациентов
        1.3 У отделения поля: наименование отделения, список палат (коллекция Set)
        1.4 Создать пациентов. Распределить их по палатам. В одной палате по 3 пациента максимум.
            При этом попробуйте добавит двух пациентов, с одинаковыми полями.
            Если количество пациентов в палате увеличилось, значит неправильно реализованы equals и hashСode.
            Палаты распределить по отделениям.
        1.5 Посчитать количество мужчин и женщин в отделении.
        1.6 Реализовать метод добавления пациента в палату на основе диагноза.
            Т.е, в палате должны лежать пациенты с одинаковыми диагнозами. Метод реализовать в классе Палата.
        1.7 В классе Палата создать метод, которые выводить информацию по всем пациентам в палате.
        1.8*. Сортировать пациентов по идентификационному номеру. (коллекция TreeSet, интерфейс Comparable)
            Для этого в классе Палата пациенты должны лежать в коллекции TreeSet.
            А класс пациент должен имплементировать интерфейс Comparable

     */
}
