package by.Homework.lessons.HW5;

public class Task10 {
    /* Домашнее задание №10
        Задача
        1. Переопределить метод equals и hashcode в классах Птица и Собака из предыдущего задания.
        Вопросы для проработки
        1. Что такое абстрактный класс?
        Как создать абстрактный класс?
        2. Отличие абстрактного класса от обычного.
        3. Расскажите про класс Object. Какие методы определены в классе Object?
        4. Что такое переопределение методов. Чем переопределение методов отличается от перегрузки методов?

     */
}
