package by.Homework.lessons.HW8;

public class Task15 {
    /* Домашнее задание №15
        Гербер Шилдт. Полное руководство. Java 12 -ое издание. Страницы: 648-743
        1.1.Создать класс. Сотрудник.
        1.2.Поля у сотрудника. Идентификационный номер, Имя, фамилия, возраст, зарплата.
        1.3.Создать сотрудников (создайте штук восемь)
        1.4.Создать мапку и записать туда созданных сотрудников в качестве ключа., а в качестве значения им присвоить им профессию.
        1.5 Реализуйте статический метод в классе Main, который повысит зарплату сотрудникам одной профессии.
            Сигнатура метода к примеру такая: private static void raiseSalaryForProfession(Map<Employee, String> employees, int amountOfIncrease).
            Например: Необходимо повысить зарплату плотникам на 200 рублей. (Обратите внимание на метод entrySet).
        1.6*. Необходимо написать метод, который будет из мапки описанной в п.2.4 создаст мапку
            типа HashMap<String, Collection<Сотрудник>>. Т.е, поменять местами Квалифакацию и сотрудника
            (в качестве ключа будет выступать квалификация, в качестве значения-коллекция сотрудников).
        Сроки выполнения 05.07.2026 Ссылку на пул реквест бросать мне в личку в телеграмме

        Вопросы для проработки
        1. Что такое коллекция Map?
        2. Как получить все ключи из коллекции Map?
        3. Как получить все значения из коллекции Map?
        4. Гарантируется ли порядок добавления элементов в коллекцию HashMap?
        5. В какую коллекцию Map гарантирует порядок добавления элемнтов
        6. Какая коллекция при добавлении элементов может их сортировать и как это сделать?

     */
}
