package by.Homework.lessons.HW9.task21;

public class Task21 {
}

/*  Домашнее задание №21
    Гербер Шилдт. Полное руководство. Java 12 -ое издание. Страницы: с 753-770.
    Про даты начиная с java 8. https://javarush.com/quests/lectures/questsyntaxpro.level16.lecture03

    1. Вывести текущую дату в формате (пример формата: 1 апреля 2023). На выходе дата должна быть класса String
    2. Вывести текущую дату в формате (пример формата: 1 апреля 2023, 10:59:20 PM). На выходе дата должна быть класса String
    3. Перевести String (2023-03-19 : 10:12:24 AM) в формат LocalDateTime по умолчанию:
    4. Перевести String (пн 20.03.23 г. время: 15:07:28  ) в формат LocalDateTime по умолчанию:
    5. *Вывести текущую дату в формате (пример формата: понедельник 20 марта 2023 время: 11.54.06 PM). На выходе дата должна быть класса String

    С количеством букв вам нужно будет разобраться, Посмотрев дополнительно класс:
        DateTimeFormatterBuilder (строки кода для ориентира в этом классе 1537,1661, 2051).
        Там описаны буквы учавствующие в паттернах для дат.

    Срок выполнения: 26.07.2026

    Вопросы для проработки
    1. Расскажите про классы для рабтты с датами в Java (LocalDate, LocalDateTime, LocalTime, Date) В чём их отличие?

 */